{
  "backend/main.mo": "Main Motoko actor for the Sarthi app defining data types (Profile, CareerQuiz, Scholarship, Internship, MockTest, ChatSession) and persistent storage maps keyed by Principal, with static quiz/scholarship/internship data and mixins for authorization, blob storage, and HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (authentication, dashboard, career quiz, scholarships, etc.) to their source files, component dependencies, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document providing short descriptions of key frontend source files including LandingPage, Chatbot, Profile, and App.tsx.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML entry point for the Sarthi React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with a public landing route and authenticated layout routes for all feature pages (dashboard, career quiz, scholarships, internships, mock test, chatbot, profile), wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/Layout.tsx": "Shared page layout component that wraps content with a TopNav header and a footer crediting caffeine.ai.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog shown to newly authenticated users to collect their name and initialize their backend profile via the saveCallerUserProfile mutation.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to the landing page, shows a loading spinner while initializing, and renders the ProfileSetupModal if the user has no saved profile.",
  "frontend/src/components/TopNav.tsx": "Renders a sticky top navigation bar with the Sarthi logo, desktop nav links, and a user avatar dropdown menu that supports profile navigation and logout.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data including user profiles, career quiz, scholarships, internships, mock tests, and chat messages.",
  "frontend/src/index.css": "Defines global Tailwind CSS base styles, a deep teal and saffron/amber design token palette for light and dark modes, and custom utility classes for gradients and card hover effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/CareerQuiz.tsx": "Renders a multi-step career quiz page that fetches questions from the backend (with fallback questions), tracks answers, shows progress, and submits results before navigating to the results page.",
  "frontend/src/pages/CareerQuizResult.tsx": "Displays the career quiz result page showing the recommended stream, suggested subjects, and career scope fetched via a query hook, with loading skeletons and navigation back to the dashboard.",
  "frontend/src/pages/Chatbot.tsx": "Implements an AI chatbot page that loads chat history, sends user messages, displays grouped messages by date, and shows suggested questions and a welcome message when no history exists.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with a hero banner greeting the logged-in user and a grid of feature cards linking to Career Quiz, Scholarships, Internships, Mock Tests, and AI Chatbot pages.",
  "frontend/src/pages/Internships.tsx": "Shows a filterable, searchable list of static internship listings categorized by domain, with save/bookmark functionality and external application links.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page that presents Sarthi's features, handles Internet Identity login, and redirects authenticated users to the dashboard.",
  "frontend/src/pages/MockTest.tsx": "Renders a subject-selection and timed quiz interface for mock tests, fetching questions from the backend with fallback static questions, and submitting answers to calculate scores.",
  "frontend/src/pages/MockTestResult.tsx": "Displays the mock test result page showing score, percentage, rating, and stats (correct/wrong) using URL search params passed from the test submission.",
  "frontend/src/pages/Profile.tsx": "User profile page allowing students to view and edit personal info, toggle dark/light theme, view saved scholarships and internships, and log out.",
  "frontend/src/pages/Scholarships.tsx": "Lists scholarships by merging backend data with static fallback entries, supporting search and Government/Private filtering, with save-to-profile functionality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them in sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts (Nunito, Plus Jakarta Sans), OKLCH-based color tokens (primary, secondary, sidebar, teal, amber, chart colors), border radius, box shadows, and enabling dark mode, typography, container queries, and animate plugins.",
  "project_state.json": "Project state descriptor for Sarthi, an AI-based educational and career guidance web app built with React/TypeScript frontend and Internet Computer (Motoko) backend, documenting architectural notes, existing features (auth, dashboard, career quiz, scholarships, internships, mock tests, AI chatbot, profile), required images, and known issues."
}